[
    {
        "company": "Bell",
        "jobTitle": "BI Developer/Big Data Engineer",
        "jobDesc": "During my time at Bell I acted as the lead developer on multiple high visibility projects, some impacting millions of customers. Additionally, I designed and implemented project architecture using a variety of technologies. Further responsibilities included working with internal and external teams to carry out testing, determine project requirements, generate documentation and conduct knowledge transfers. During my time at Bell I was rewarded two awards for 'Execution Excellence' and 'Innovation.'",
        "logo": "",
        "dateRange": "May 2020 - Sept 2021"
    },
    {
        "company": "SpencerV Development",
        "jobTitle": "Freelance Web Developer",
        "jobDesc": "As a freelance web developer I work closely with clients to create bespoke and accessible websites. All designs are made in Figma, and sculpted to effectively represent the clients brand. The sites I produce are dynamic, modern, and fast, all managed via CMS.",
        "logo": "",
        "dateRange": "Jan 2021 - Current"
    },
    {
        "company": "Beta Lab",
        "jobTitle": "Android Developer",
        "jobDesc": "While working for BetaLab I primarily operated as a frontend Android developer. Working alongside a team of passionate developers, we completed complex, client facing projects, without any compensation. Instead, what I received in exchange for my work was the fundamental knowledge and skills in software architecture which aid me to this day.",
        "logo": "",
        "dateRange": "Sept 2018 - April 2020"
    },
    {
        "company": "Kumon",
        "jobTitle": "Math/Reading Tutor",
        "jobDesc": "From the ages of 13 to 17 I worked for Kumon as a Math and English tutor. In this position I learnt patience and largely improved my communication skills. The students I helped ranged from grades one to twelve.",
        "logo": "",
        "dateRange": "Jan 2013 - Sept 2017"
    }
]